// [_SHA256 хэшы_](https://en.wikipedia.org/wiki/SHA-2) часта выкарыстоўваюцца
// для вылічэння кароткіх ідэнтыфікатараў для бінарных
// або тэкставых блобаў. Напрыклад, сертыфікаты TLS/SSL выкарыстоўваюць SHA256
// для вылічэння подпісу сертыфіката. Вось як вылічыць
// SHA256 хэшы ў Go.

package main

// Go рэалізуе некалькі хэш-функцый у розных
// пакетах `crypto/*`.
import (
	"crypto/sha256"
	"fmt"
)

func main() {
	s := "sha256 this string"

	// Тут мы пачынаем з новага хэша.
	h := sha256.New()

	// `Write` прымае байты. Калі ў вас ёсць тэкс `s`,
	// выкарыстоўвайце `[]byte(s)`, каб пераўтварыць яго ў байты.
	h.Write([]byte(s))

	// Тут атрымліваецца канчатковы вынік хэш ў выглядзе слайса байтаў
	// Функцыю `Sum` можна выкарыстоўваць для дадання
	// да існуючага байтавага слайсу: звычайна гэта не патрабуецца.
	bs := h.Sum(nil)

	fmt.Println(s)
	fmt.Printf("%x\n", bs)
}
