# Запуск праграмы вылічвае хэш і друкуе яго ў
# зручным для чытання фармаце.
$ go run sha256-hashes.go
sha256 this string
1af1dfa857bf1d8814fe1af8983c18080019922e557f15a8a...


# Вы можаце вылічыць іншыя хэшы, выкарыстоўваючы падобны шаблон да
# паказанага вышэй. Напрыклад, каб вылічыць
# хэшы SHA512, імпартуйце `crypto/sha512` і выкарыстоўвайце
# `sha512.New()`.

# Звярніце ўвагу, што калі вам патрэбныя крыптаграфічна бяспечныя хэшы,
# вам варта ўважліва даследаваць
# [Надзейнасць хэша](https://en.wikipedia.org/wiki/Cryptographic_hash_function)!
