// `for` — адзіная канструкцыя паўтарэння ў Go.
// Вось некаторыя асноўныя тыпы цыклаў `for`.

package main

import "fmt"

func main() {

	// Найбольш базавы тып з адной умовай.
	i := 1
	for i <= 3 {
		fmt.Println(i)
		i = i + 1
	}

	// Трыдыцыйный тып паўтарэнняў `for` з пачатковым значэннем/умовай/зменай.
	for j := 0; j < 3; j++ {
		fmt.Println(j)
	}

	// Іншы спосаб выканання ітэрацыц
	// N разоў у пэўным дыяпазоне лічбаў
	for i := range 3 {
		fmt.Println("range", i)
	}

	// `for` без умовы будзе паўтарацца паўторна
	// пакуль вы не выйдзеце з цыкла праз `break` або не вернецеся з
	// функцыі, якая яго ахоплівае.
	for {
		fmt.Println("loop")
		break
	}

	// Кап перайсці да наступнай стэрацыі не выконваючы ўсе каманды да канчца
	// выкарыстоўвайце `continue`
	for n := range 6 {
		if n%2 == 0 {
			continue
		}
		fmt.Println(n)
	}
}
