// _Радковы фільтр_ — гэта распаўсюджаны тып праграмы, якая чытае
// уваходныя дадзеныя на stdin, апрацоўвае іх, а затым выводзіць нейкі
// вынік на stdout. `grep` і `sed` — распаўсюджаныя
// радковыя фільтры.

// Вось прыклад радковага фільтра ў Go, які запісвае
// вялікія літары ўсяго ўваходнага тэксту. Вы можаце выкарыстоўваць гэты
// шаблон для напісання ўласных радковых фільтраў Go.
package main

import (
	"bufio"
	"fmt"
	"os"
	"strings"
)

func main() {

	// Абгортванне небуферызаванага `os.Stdin` буферызаваным
	// сканерам дае нам зручны метад `Scan`, які
	// пераводзіць сканер да наступнага токена; які з'яўляецца // наступным радком у сканеры па змаўчанні.
	scanner := bufio.NewScanner(os.Stdin)

	for scanner.Scan() {
		// `Тэкст` вяртае бягучы токен, тут наступны радок,
		// з уваходных дадзеных.
		ucl := strings.ToUpper(scanner.Text())

		// Запішыце радок з вялікай літары.
		fmt.Println(ucl)
	}

	// Праверка на наяўнасць памылак падчас `Scan`. Канец файла чакаецца і не паведамляецца `Scan` як памылка.
	if err := scanner.Err(); err != nil {
		fmt.Fprintln(os.Stderr, "error:", err)
		os.Exit(1)
	}
}
