// Звычайны канал _небуферызаваныя_, гэта значыць, што яны
// будзе прымаць значэнне (`chan <-`) толькі тыды, калі ёсць
// прыёмнік (`<-chan`) гатовы да атрымання адпраўленнага значэнне.
// _Буферызаваныя каналы_ прымаюць абмежаваную колькасць значэнняў
// без адпаведнага прымача для гэтыя значэнні.

package main

import "fmt"

func main() {

	// Тута ствараецца канал радкоў, які будзе буферызаваць да
	// 2 значэнь
	messages := make(chan string, 2)

	// Паколькі гэты канал за буферам, мы можам адправіць значэнні
	// ў канал без адпаведнага праёмніка.
	messages <- "buffered"
	messages <- "channel"

	// Пазней гэтыя два значэнні атрымліваююца, звычайным парадкам.
	fmt.Println(<-messages)
	fmt.Println(<-messages)
}
