// _Каналы_ — гэта трубы, якія злучаюцца канкурэнтныя
// горуціны. Вы можаце адпраўляць значэнні ў каналы з адной
// горуціны і атрымаць іх у другой.

package main

import "fmt"

func main() {

	// Ствараецца новы канал праз `make(chan val-type)`.
	// Каналы тыпізуюцца праз тып якія яны перадаюць.
	messages := make(chan string)

	// Канструкцыя `channel <-` _адпраўляе_ значэння ў канал.
	// Ніжэй `"ping"` адпраўляецца ў канал `messages`, створаны вышэй,
	// з новай горуціны.
	go func() { messages <- "ping" }()

	// Канструкцыя `<-channel` _атрымлівае_ значэнне з
	// канал. Тут мы атрымаем і выводзіцца `"ping"` які быў
	// адпраўлены вышэй.
	msg := <-messages
	fmt.Println(msg)
}
