# Звярніце ўвагу, што, хоць зрэзы і масівы маюць розныя тыпы,
# яны адлюстроўваюцца падобным чынам з дапамогай `fmt.Println`.
$ go run slices.go
uninit: [] true true
emp: [  ] len: 3 cap: 3
set: [a b c]
get: c
len: 3
apd: [a b c d e f]
cpy: [a b c d e f]
sl1: [c d e]
sl2: [a b c d e]
sl3: [c d e f]
dcl: [g h i]
t == t2
2d:  [[0] [1 2] [2 3 4]]

# Глядзіце гэты [выдатны артыкул](https://go.dev/blog/slices-intro)
# ад каманды Go, каб даведацца больш пра дызайн і
# рэалізацыю слайсаў у Go.

# Цяпер, калі мы разгледзелі масівы і слайсы, разгледзім
# іншую ключавую ўбудаваную структуру дадзеных Go: мапы.
