# Запуск нашай праграмы паказвае, што прыклад кіравання станам на аснове горуцін
# выконвае каля 80 000
# аперацый.
$ go run stateful-goroutines.go
readOps: 71708
writeOps: 7177

# У гэтым канкрэтным выпадку падыход на аснове горуцін
# быў крыху больш складаным, чым падыход на аснове м'ютэкса. Ён
# можа быць карысным у некаторых выпадках, напрыклад,
# калі ў вас задзейнічаны іншыя каналы або пры кіраванні
# некалькімі такімі м'ютэксамі, што можа прыводзіць да памылак. Вам варта
# выкарыстоўваць той падыход, які здаецца найбольш натуральным, асабліва
# з пункту гледжання разумення карэктнасці вашай
# праграмы.
