# Каб запусціць праграму яе трэбя зберагчы ў файл `hello-world.go` і
# напісаць `go run` ў тэрмінале
$ go run hello-world.go
hello world

# Часам трэба будзе сабраць нашы праграмы ў бінарныя файлы.
# Для гэтага трэба яке скампіліраваць камандай `go build`.
$ go build hello-world.go
$ ls
hello-world	hello-world.go

# Пасля кампіляцыі праграму можна выконваць без кампілятра Go
$ ./hello-world
hello world

# Цяпер, калі мы можам запускаць і ствараць просты праграмы на Go, давайце
# даведаемся больш пра Go.
