// `Паніка` звычайна азначае, што нешта пайшло нечакана
// не так. Часцей за ўсё мы выкарыстоўваем яе для хуткага вырашэння праблем з памылкамі, якія
// не павінны ўзнікаць падчас нармальнай працы, або з якімі мы
// не гатовыя справіцца карэктна.

package main

import "os"

func main() {

	// Мы будзем выкарыстоўваць panic на гэтым сайце для праверкі на наяўнасць
	// нечаканых памылак. Гэта адзіная праграма на
	// сайце, прызначаная для панікі.
	panic("a problem")

	// Звычайная функцыя panic выкарыстоўваецца для перапынення выканання, калі яна вяртае значэнне памылкі, якое мы не ведаем, як
	//(ці хочам) апрацаваць. Вось прыклад таго, як
	// `panic`king выклікае нечаканую памылку пры стварэнні новага файла.
	_, err := os.Create("/tmp/file")
	if err != nil {
		panic(err)
	}
}
