// У Go _зменныя_ аб'яўляюцца дакладна і выкарыстоўваюцца
// кампілятарам, для праверкі тыпізацыі і выклікаў функцый.

package main

import "fmt"

func main() {

	// `var` аб'яўляе 1 або больш зменных.
	var a = "initial"
	fmt.Println(a)

	// Можна аб'явіць некалькі зменных адначасова.
	var b, c int = 1, 2
	fmt.Println(b, c)

	// Go вызначыць тып ініцыялізаваных зменных.
	var d = true
	fmt.Println(d)

	// Зменныя, абвешчаныя без адпаведнай
	// ініцыялізацыі, маюць _нулявое значэнне_. Напрыклад,
	// нулявое значэнне для `int` роўнае `0`.
	var e int
	fmt.Println(e)

	// Сінтаксіс `:=` — гэта скарочаная форма аб'яўлення і
	// ініцыялізацыі зменнай, напрыклад, for
	// у гэтым выпадку `var f string = "apple"`.
	// Гэты сінтаксіс даступны толькі ўнутры функцый.
	f := "apple"
	fmt.Println(f)
}
