# Запуск гэтай праграмы прывядзе да яе панікі, друку
# паведамлення пра памылку і трасіроўкі goroutine, а таксама да выхаду з
# ненулявым статусам.

# Калі спрацоўвае першая паніка ў `main`, праграма завяршаецца
# не даходзячы да астатняй часткі кода. Калі вы хочаце
# бачыць, як праграма спрабуе стварыць часовы файл, закаментуйце
# першы выхад панікі.
$ go run panic.go
panic: a problem

goroutine 1 [running]:
main.main()
	/.../panic.go:12 +0x47
...љ
exit status 2

# Звярніце ўвагу, што ў адрозненне ад некаторых моў праграмавання, якія выкарыстоўваюць выключэнні
# для апрацоўкі многіх памылак, у Go з'яўляецца ідыяматычным
# выкарыстоўваць вяртаемыя значэнні, якія паказваюць памылкі, дзе гэта магчыма.
